.emacs.d/PrivateConfig.org
#+TITLE: Custom Emacs Configuration
#+PROPERTY: header-args:emacs-lisp :tangle ./private-config.el
#+STARTUP: overview indent hidestars
#+OPTIONS: toc:2

* Introduction
This config is built by copying parts from [[https://github.com/daviwil/dotfiles/blob/master/Emacs.org][System Crafters dotfiles repo]], what I found on the internet (Reddit, Discord, Stack Overflow, etc.) and some of my own config. This configuration is based on the [[https://en.wikipedia.org/wiki/Literate_programming][literate programming]] paradigm which makes the config be self-documenting. This means, the file is basically a fully explained documentation of my config and also contains code blocks in between that can be evaluated and tangled into a config file.
** Personal Information
It's useful to set up personal information. Some packages tend to use it.
#+begin_src emacs-lisp
  (setq user-full-name "Rajath Ramakrishna"
        user-mail-address "r.rajath@pm.me")
#+end_src

I've been using Emacs since Aug 2020. I used Spacemacs briefly for about a month and it was slow, clunky and I didn't have a good workflow for editing org files on my phone. I decided to give Emacs another go and used Doom Emacs since it looked prettier and I instantly fell in love with it. I used Doom Emacs for about a year and some time late August 2021 is when I started building my own config.

If this is the first time you are looking at my configuration, feel free to jump around and look at any code blocks. Headings that are marked with =TODO= need some work. They either have configs that are not completely set up or have tangling disabled, or just need some text.
** Why literate config?
Literate config has a few benefits:
- Easy to understand. Thanks to the documentation surrounding the code snippets
- Easy to share. People you share this with need no explanation as to what's in your config, your documentation takes care of that
- Easy to maintain. You never touch the actual config, you only update this .org file and make it generate the actual source file
- Easy to publish. If you want to publish your config online, it's super easy. GitHub, for example, natively supports org the same way it supports Markdown. So, these org files are rendered nicely, just as regular documentation.
* Current Issues
** TODO Hitting TAB on a drawer doesn't expand/collapse the drawer
This is because the TAB in org-mode is mapped to =org-only-cycle-subtree-h=
Workaround: Use =z a= which maps to =evil-toggle-fold=
** TODO Smart modeline is cutting off the git branch name
The git branch name appears at the right end of the mode line and smart-mode-line is displaying only the last 3 characters.
* First things first
** Startup Performance
#+begin_src emacs-lisp
  (setq gc-cons-threshold (* 50 1000 1000))

  (defun rr/display-startup-time ()
    (message "Emacs loaded in %s with %d garbage collections."
             (format "%.2f seconds"
                     (float-time (time-subtract after-init-time before-init-time)))
             gcs-done))
  (add-hook 'emacs-startup-hook #'rr/display-startup-time)
#+end_src
** Frame Management
I want Emacs to take up full screen if I'm on my laptop and take up half of the right screen if I'm on a bigger monitor. This is not the best way of implementing it, but since I'm still learning and it gets the job done, I'm happy with it for now. I'll come back and optimize this once I learn elisp better.
=1792= in the code block below is the pixel width of my laptop.
=5232= is the pixel width of my monitor.
If =display-pixel-width= is neither of these, then the frame will not be moved or resized.
[[https://emacs.stackexchange.com/questions/16961/how-to-set-emacs-frame-size-by-pixels/17354#17354][A stack overflow post]] has another way to set this; something I want to try in the future.
#+begin_src emacs-lisp
  (message "Trying to maximize frame")
  (setq pixel-width (display-pixel-width))
  (setq pixel-height (display-pixel-height))

  (cond
   ((= pixel-width 1792)
    (add-to-list 'default-frame-alist '(fullscreen . maximized)))
   ((= pixel-width 5232)
    (progn
      (add-to-list 'default-frame-alist
                   (cons 'left 1720))
      (add-to-list 'default-frame-alist
                   (cons 'width 214))
      (add-to-list 'default-frame-alist
                   (cons 'height 81))
      )))
#+end_src
** Package Management
Adding package sources and setting =use-package-always-ensure= to =t=. This setting will eliminate the need to specify =:ensure t= while running writing =use-package= commands.
#+begin_src emacs-lisp
  ;; Initialize package sources
  (require 'package)

  (setq package-archives '(("melpa" . "https://melpa.org/packages/")
                           ("melpa-stable" . "https://stable.melpa.org/packages/")
                           ("org" . "https://orgmode.org/elpa/")
                           ("elpa" . "https://elpa.gnu.org/packages/")))

  ;; Fix an issue accessing the ELPA archive in Termux

  ;; (package-initialize)
  ;; (unless package-archive-contents
  ;;   (package-refresh-contents))

  ;; Initialize use-package on non-Linux platforms
  (package-install 'use-package)
  (require 'use-package)

  ;; Uncomment this to get a reading on packages that get loaded at startup
  ;;(setq use-package-verbose t)

  ;; On non-Guix systems, "ensure" packages by default
  (setq use-package-always-ensure t)
  (setq use-package-verbose t)
#+end_src
** Keep .emacs.d clean
This is to avoid emacs from creating temporary files:
Package: [[https://github.com/emacscollective/no-littering][no-littering]]
#+begin_src emacs-lisp
  (use-package no-littering)

  (setq auto-save-file-name-transforms
        `((".*" ,(no-littering-expand-var-file-name "auto-save/") t)))

  (setq custom-file (expand-file-name "custom.el" user-emacs-directory))
#+end_src
** Auto update packages
Automatically update packages. Nothing more to it.
Package: [[https://github.com/rranelli/auto-package-update.el][auto-package-update]]
#+begin_src emacs-lisp
  (use-package auto-package-update
    :custom
    (auto-package-update-interval 7)
    (auto-package-update-prompt-before-update t)
    (auto-package-update-hide-results t)
    :config
    (auto-package-update-maybe)
    (auto-package-update-at-time "09:00"))
#+end_src
** Basic Setup
*** Some defaults
I want files to move to trash when I delete them in Emacs. I want better undo unlike vim where entire block is considered giant undo step. This settting changes the undo structure into finer steps. I also want to auto save files by default.
#+begin_src emacs-lisp
  (setq-default
   delete-by-moving-to-trash t
   evil-want-fine-undo t
   auto-save-default t)
#+end_src
*** Enable Global Subword Mode
Subword mode is great when you have to deal with camel case (or pascal case) strings. For example, if you have a word like EmacsIsAwesome, you can move between Emacs, Is and Awesome.
#+begin_src emacs-lisp
  (global-subword-mode 1)
#+end_src
* UI Configuration
** Get rid of the startup message
This is to remove the ugly annoying startup message on a white screen that you get when you load emacs (without any custom configs)

#+begin_src emacs-lisp
  (setq inhibit-startup-message t)
#+end_src
** Remove menubar, toolbar, scrollbars, etc.
Maximize the goodness
#+begin_src emacs-lisp
  (scroll-bar-mode -1)
  (tool-bar-mode -1)
  (tooltip-mode -1)
  (set-fringe-mode 0)
  (menu-bar-mode -1)
#+end_src
** Set up fonts
This font face will be used everywhere in Emacs, not just in source code
#+begin_src emacs-lisp
  (set-face-attribute 'default nil :font "JetBrains Mono" :height 125)
#+end_src
** Set up theme
I use the Doom-One theme with a Doom modeline and also use all-the-icons for pretty icons. The following code block sets them up
Packages:
- [[https://github.com/seagle0128/doom-modeline][doom-modeline]]
- [[https://github.com/hlissner/emacs-doom-themes][doom-themes]]
- [[https://github.com/domtronn/all-the-icons.el][all-the-icons]]
#+begin_src emacs-lisp
  (use-package doom-modeline
    :ensure t
    :init (doom-modeline-mode 1))

  (use-package doom-themes
    :config
    (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
          doom-themes-enable-italic t) ; if nil, italics is universally disabled
    (load-theme 'doom-one t)

    ;; Enable flashing mode-line on errors
    (doom-themes-visual-bell-config)
    ;; Enable custom neotree theme
    ;; (doom-themes-neotree-config)
    (doom-themes-org-config))

  (use-package all-the-icons)
#+end_src
** Show line and column numbers
I want to see line numbers and column numbers in most modes execpt a few.
#+begin_src emacs-lisp
  (column-number-mode)
  (global-display-line-numbers-mode t)

  ;; disable line numbers for some modes
  (dolist (mode '(org-mode-hook
                  term-mode-hook
                  shell-mode-hook
                  treemacs-mode-hook
                  eshell-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 0))))
#+end_src
** Rainbow Delimiters
Lisp stands for Lots of Irritating Superfluous Parentheses. Let's make them colorful at least.
Package: [[https://github.com/Fanael/rainbow-delimiters][rainbow-delimiters]]
#+begin_src emacs-lisp
  (use-package rainbow-delimiters
    :hook (prog-mode . rainbow-delimiters-mode))
#+end_src
** Smart Modeline
Make the mode line pretty
Package: [[https://github.com/Malabarba/smart-mode-line][smart-mode-line]]
#+begin_src emacs-lisp
  (use-package smart-mode-line
    :config
    (setq
     sml/theme 'atom-one-dark
     sml/no-confirm-load-theme t
     sml/mode-width 'right
     sml/name-width 60)
    (sml/setup))
#+end_src
** Highlight Matching Braces
This is super helpful, especially in lisp
#+begin_src emacs-lisp
  (use-package paren
    :config
    (set-face-attribute 'show-paren-match-expression nil :background "#363e4a")
    (show-paren-mode 1))
#+end_src
* Usability
** Server Mode
Make this instance of emacs start server so that other client instances can connect to this.
#+begin_src emacs-lisp
  (server-start)
#+end_src
** Auto-saving changed files
This removes the need to hit Save all the time.
#+begin_src emacs-lisp
  (use-package super-save
    :defer 1
    :diminish super-save-mode
    :config
    (super-save-mode +1)
    (setq super-save-auto-save-when-idle t))
#+end_src
** Auto-reverting changed files
This is to make sure regular files are reloaded when they're changed outside Emacs. For example, a file may have changed from another device (via Dropbox). Having the file open already and just going to that buffer will auto revert the file so that there are no overwrites.
#+begin_src emacs-lisp
  ;; Revert Dired and other buffers
  (setq global-auto-revert-non-file-buffers t)

  ;; Revert buffers when the underlying file has changed
  (global-auto-revert-mode 1)
#+end_src
** Commenting Lines
*** Basic setup
Commenting lines is now easy and works across languages.
Package: [[https://github.com/redguardtoo/evil-nerd-commenter][evil-nerd-commenter]]
#+begin_src emacs-lisp
  (use-package evil-nerd-commenter
    :after evil)
#+end_src
*** Comment and Newline
When I comment a line, I'd like that line to be commented and the cursor to be moved to the next line. This way, I can keep hitting the comment line keybinding repeatedly without having to manually move to the next line. This custom function will help me do that. It is also bound to =s-/=
#+begin_src emacs-lisp
  (defun rr/comment-and-newline ()
    (interactive)
    (evilnc-comment-or-uncomment-lines 1)
    (evil-next-line))

  (general-define-key
   :states '(normal insert)
   "s-/" 'rr/comment-and-newline)
#+end_src
