.emacs.d/PrivateConfig.org
** Automatically clean whitespaces
Trim whitespace at the end of the line. This happens when the buffer is saved and is unobtrusive. This means the user is not aware of the trimming that has happened. So, the point is not moved, but when the buffer is reverted this can be seen.
Package: [[https://github.com/lewang/ws-butler][ws-butler]]
#+begin_src emacs-lisp
  (use-package ws-butler
    :hook ((text-mode . ws-butler-mode)
           (prog-mode . ws-butler-mode)))
#+end_src
** Smart Parenthesis
Add closing parenthesis whenever you open parenthesis.
Package: [[https://github.com/Fuco1/smartparens][smartparens]]
#+begin_src emacs-lisp
  (use-package smartparens)
  (smartparens-global-mode)
#+end_src
** Jumping around with Avy
Jump to any character, word or line in the visible region. Keybindings for this are described under Keybindings/General configuration.
Package: [[https://github.com/abo-abo/avy][avy]]
#+begin_src emacs-lisp
  (use-package avy
    :commands (avy-goto-char avy-goto-word-0 avy-goto-line))
#+end_src
** Eros Mode
While evaluating elisp expressions in a buffer, the eval results will be displayed as an overlay next to the expression instead of the echo area
Package: [[https://github.com/xiongtx/eros][eros]]
#+begin_src emacs-lisp
  (use-package eros)
  (eros-mode 1)
#+end_src
* Keybindings
** Make ESC work better
#+begin_src emacs-lisp
  ;; Making ESC key work like an ESC key by exiting/canceling stuff
  (global-set-key (kbd "<escape>") 'keyboard-escape-quit)
#+end_src
** Switch buffers easily
#+begin_src emacs-lisp
  (global-set-key (kbd "C-M-j") 'counsel-switch-buffer)
#+end_src
** Which key
#+begin_src emacs-lisp
  (use-package which-key
    :defer 0
    :diminish which-key-mode
    :config
    (which-key-mode)
    (setq which-key-idle-delay 0.3))
#+end_src
** Evil
*** Basic Setup
#+begin_src emacs-lisp
  (use-package evil
    :init
    (setq evil-want-integration t)
    (setq evil-want-keybinding nil)
    (setq evil-want-C-u-scroll t)
    (setq evil-want-C-i-jump nil)
    :config
    (evil-mode 1)
    (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
    (define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join)

    ;; Use visual line motions even outside of visual-line-mode buffers
    (evil-global-set-key 'motion "j" 'evil-next-visual-line)
    (evil-global-set-key 'motion "k" 'evil-previous-visual-line)

    (evil-set-initial-state 'messages-buffer-mode 'normal)
    (evil-set-initial-state 'dashboard-model 'normal))

  (evil-mode 1)

  ;; Evil Collection for predictable Vim keybindings in a lot of modes
  (use-package evil-collection
    :after evil
    :config
    (evil-collection-init))
#+end_src
*** Custom keybindings
Deleting words or lines make the deleted text end up in kill ring. This prevents me from pasting what I initially had in the clipboard. The following functions rewrite delete-word and delete-line functionalities without adding them to the kill-ring.
Currently, this is disabled. Will enable it once it's thoroughly tested.
#+begin_src emacs-lisp :tangle no
  (defun rr/delete-word (arg)
    (interactive "p")
    (delete-region
     (point)
     (progn
       (forward-word arg)
       (point))))

  (general-define-key
   :states 'normal
   "C-;" 'my-delete-word)
#+end_src
** General
#+begin_src emacs-lisp
  (use-package general
    :config
    (general-evil-setup t))

  (general-define-key
   :states 'normal
   :keymaps 'override
   :prefix "SPC"
   "SPC" '(counsel-M-x :which-key "M-x")
   "X"   '(org-capture :which-key "org-capture")
   "`"   '(evil-switch-to-windows-last-buffer :which-key "last window")
   "RET" '(counsel-bookmark :which-key "bookmarks")
   "t"   '(vterm-toggle :which-key "vterm-popup")
   ;; buffer management
   "b"   '(:ignore t :which-key "buffers")
   "b i" '(ibuffer :which-key "ibuffer")
   "b r" '(revert-buffer :which-key "revert-buffer")
   "b k" '(kill-buffer :which-key "kill-buffer")
   ;; perspectives
   "s"   '(:ignore t :which-key "perspectives")
   "s b" '(persp-switch-to-buffer* :which-key "switch-to-buffer")
   "s k" '(persp-kill-buffer :which-key "kill-buffer")
   "s a" '(persp-add-buffer :which-key "add-buffer")
   "s A" '(persp-set-buffer :which-key "set-buffer")
   "s s" '(persp-switch :which-key "persp-switch")
   "s r" '(persp-rename :which-key "persp-rename")
   ;; dired
   "d"   '(:ignore t :which-key "dired")
   "d j" '(dired-jump :which-key "dired-jump")
   "d J" '(dired-jump-other-window :which-key "dired-jump-other-window")
   "d d" '(dired :which-key "dired")
   ;; window management
   "w"   '(:ignore t :which-key "window")
   "w v" '(split-window-right :which-key "split window right")
   "w h" '(split-window-below :which-key "split window below")
   "w c" '(delete-window :which-key "delete-window")
   "w w" '(next-window-any-frame :which-key "next window")
   ;; help for variables, functions, keybindings, etc.
   "h"   '(:ignore t :which-key "help")
   "h a" '(counsel-apropos :which-key "apropos")
   "h v" '(counsel-describe-variable :which-key "variable")
   "h f" '(counsel-describe-function :which-key "function")
   "h k" '(helpful-key :which-key "key")
   "h i" '(info :which-key "info")
   "h c" '(describe-key-briefly :which-key "describy-key-briefly")
   ;; jump with avy
   "j"   '(:ignore t :which-key "jump")
   "j j" '(avy-goto-char :which-key "avy-goto-char")
   "j w" '(avy-goto-word-1 :which-key "avy-goto-word-1")
   "j l" '(avy-goto-line :which-key "avy-goto-line")
   ;; magit status
   "g"   '(:ignore t :which-key "magit")
   "g g" '(magit-status :which-key "magit status")
   ;; org-mode
   "o"   '(:ignore t :which-key "org-mode")
   ;; org-mode
   "o a" '(org-agenda :which-key "org-agenda")
   "o t" '(org-todo :which-key "org-todo")
   "o x" '(org-toggle-checkbox :which-key "org-toggle-checkbox")
   "o r" '(:ignore t :which-key "refile")
   "o r r" '(org-refile :which-key "org-refile")
   "o r A" '(org-archive-subtree :which-key "org-archive-subtree")
   "o h" '(org-toggle-heading :which-key "heading")
   "o i" '(org-toggle-item :which-key "item")
   "o o" '(counsel-outline :which-key "counsel-outline")
   "o S" '(org-show-todo-tree :which-key "org-show-todo-tree")
   ;; org-mode / date
   "o d" '(:ignore t :which-key "date/deadline")
   "o d s" '(org-schedule :which-key "org-schedule")
   "o d d" '(org-deadline :which-key "org-deadline")
   "o d t" '(org-time-stamp :which-key "org-time-stamp")
   "o d T" '(org-time-stamp-inactive :which-key "org-time-stamp-inactive")
   ;; org-mode / links
   "o l" '(:ignore t :which-key "links")
   "o l l" '(org-insert-link :which-key "org-insert-link")
   ;; projectile
   "p"   '(:ignore t :which-key "projectile")
   "p f" '(projectile-find-file :which-key "projectile-find-file")
   "p /" '(counsel-projectile-rg :which-key "counsel-projectile-rg")
   "p r" '(projectile-recentf :which-key "projectile-recentf")
   "p s" '(counsel-projectile-switch-project :which-key "projectile-switch-project")
   ;; files
   "f"   '(:ignore t :which-key "files")
   "f f" '(counsel-find-file :which-key "find file")
   "f r" '(counsel-recentf :which-key "recent files"))

  (general-define-key
   :states '(normal insert)
   "C-e" 'evil-org-end-of-line
   "C-a" 'evil-org-beginning-of-line
   "C-n" 'evil-next-line
   "C-p" 'evil-previous-line)

  (general-define-key
   :keymaps 'normal
   "s-]" 'persp-next
   "s-[" 'persp-prev)
#+end_src
** Remap universal argument
Default keybinding for =prefix-argument= is =C-u=, but since this is now mapped to scrolling up half a page, it needs a new keybinding. The following code block remaps it to =C-S-u=.
#+begin_src emacs-lisp
  (general-define-key
   :states 'normal
   "C-S-u" 'universal-argument)
#+end_src
** Hydra
*** Package Setup
With a prefix set, Hydra helps you run similar commands in succession without having to run them with the prefix each time. For example, resizing windows or text scaling become much easier with this.
#+begin_src emacs-lisp
  (use-package hydra
    :defer t)

  (defhydra hydra-window-resize (global-map "C->")
    "resize"
    ("l" enlarge-window-horizontally "enlarge-horizontal")
    ("h" shrink-window-horizontally "shrink-horizontal")
    ("j" enlarge-window "enlarge-vertical")
    ("k" shrink-window "shrink-vertical"))
#+end_src
* Completion Frameworks
** Ivy
#+begin_src emacs-lisp
  (use-package ivy
    :diminish
    :bind (("C-s" . swiper)
           :map ivy-minibuffer-map
           ("TAB" . ivy-alt-done)
           ("C-f" . ivy-alt-done)
           ("C-l" . ivy-alt-done)
           ("C-j" . ivy-next-line)
           ("C-k" . ivy-previous-line)
           :map ivy-switch-buffer-map
           ("C-k" . ivy-previous-line)
           ("C-l" . ivy-done)
           ("C-d" . ivy-switch-buffer-kill)
           :map ivy-reverse-i-search-map
           ("C-k" . ivy-previous-line)
           ("C-d" . ivy-reverse-i-search-kill))
    :init
    (ivy-mode 1))

  (use-package ivy-rich
    :after ivy
    :init
    (ivy-rich-mode 1))
#+end_src
